In [1]:
import pandas as pd
df=pd.read_csv("titanic3.csv")

In [2]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [3]:
df_selected = df[['survived','pclass','sex','age','sibsp','parch','fare','embarked',]]

In [4]:
df_selected.isnull().sum()

survived      0
pclass        0
sex           0
age         263
sibsp         0
parch         0
fare          1
embarked      2
dtype: int64

In [5]:
df_dropped = df_selected.dropna()

In [6]:
df_dropped.isnull().sum()

survived    0
pclass      0
sex         0
age         0
sibsp       0
parch       0
fare        0
embarked    0
dtype: int64

In [7]:
x=df_dropped[['pclass','sex','age','sibsp','parch','fare','embarked',]]
y=df_dropped[['survived']]

In [10]:
x = x.replace({'sex':{'male':0,'female':1}})

In [11]:
x.head()

   pclass  sex    age  sibsp  parch      fare embarked
0       1    1  29.00      0      0  211.3375        S
1       1    0   0.92      1      2  151.5500        S
2       1    1   2.00      1      2  151.5500        S
3       1    0  30.00      1      2  151.5500        S
4       1    1  25.00      1      2  151.5500        S

In [12]:
x = pd.get_dummies(x, columns = ['embarked'])

In [13]:
x.head()

,pclass,sex,age,sibsp,parch,fare,embarked_C,embarked_Q,embarked_S
0,1,1,29.00,0,0,211.3375,0,0,1
1,1,0,0.92,1,2,151.5500,0,0,1
2,1,1,2.00,1,2,151.5500,0,0,1
3,1,0,30.00,1,2,151.5500,0,0,1
4,1,1,25.00,1,2,151.5500,0,0,1

In [14]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=.3)

In [19]:
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression()
lr.fit(x_train,y_train)
print('score',format(lr.score(x_test,y_test)))
# lr.score(x_test,y_test)

score 0.7987220447284346

/Users/odanaoki/.anyenv/envs/pyenv/versions/3.10.2/lib/python3.10/site-packages/sklearn/utils/validation.py:993: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/Users/odanaoki/.anyenv/envs/pyenv/versions/3.10.2/lib/python3.10/site-packages/sklearn/linear_model/_logistic.py:814: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(